#include <iostream>

int main() {
    int Key;

    std::cout << "Key: ";
    std::cin >> Key;    // Задаю число, яке буду шукати
    std::cout << '\n';

    const int N = 10;   // Розмір масиву

    int a[N] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};  // Масив чисел
    // Масив має бути відсортованим

    int L = 0;          // Початок масиву
    
    int R = N - 1;      // Останій індекс масиву

    int m = 0;

    while (L < R) {         // Закінчення циклу
        m = (L + R) / 2;    // Пошук середнього числа

        if (a[m] < Key) {   // Якщо середнє число менше шуканого
            L = m + 1;      // Зсув індекса вправоруч
        } else {            // Якщо середнє число більше шуканого
            R = m;          // Зсув індекса вліворуч
        }
    }

    if (a[R] == Key) {  // Якщо знайшов елемент масиву
        std::cout << "Element array has number " << R;
    } else {            // Якщо не знайшов елемент масиву
        std::cout << "Element doesn't exist";
    }
    std::cout << '\n';
    return 0;
}